#include <stdio.h>
int main()  
{  
    int i,j;  
    printf("请输入当月利润：\n");  
    scanf("%d",&i);  
    if(i <= 100000)  
        j = i * 0.1;  
    else if( i > 100000 && i <= 200000 )  
        j = 100000 * 0.1 + ( i - 100000 ) * 0.075;  
    else if( i > 200000 && i <= 400000 )  
        j = 200000 * 0.1 + (i - 200000) * 0.05;  
    else if( i > 400000 && i <= 600000 )  
        j = 400000 * 0.1 + (i - 400000) * 0.03;  
    else if( i > 600000 && i <= 1000000)  
        j = 600000 * 0.1 + (i - 600000) * 0.015;  
    else  
        j = 1000000 * 0.1 + (i - 1000000) * 0.01;  
    printf("应得的奖金是：%d\n",j);  
    return 0; 
}